In [1]:
%load_ext sql

In [2]:
%sql sqlite:///./test.db

'Connected: @./test.db'

In [4]:
%%sql
DROP table if exists emp_detail;
Create table Emp_Detail
(
EmpName Varchar(25),
Age int,
Salary Bigint,
Department Varchar(20)
)

 * sqlite:///./test.db
Done.
Done.

[]

In [5]:
%%sql
Insert into Emp_Detail Values('James',25,25000,'Admin')
,('Robert',33,39000,'Admin')
,('Richard',41,48000,'Admin')
,('Thomas',28,30000,'Admin')
,('Tom',40,55000,'Finance')
,('Donald',35,38000,'Finance')
,('Sara',32,44000,'Finance')
,('Mike',28,25000,'HR')
,('John',35,45000,'HR')
,('Mary',23,30000,'HR')
,('David',32,43000,'HR');

 * sqlite:///./test.db
11 rows affected.

[]

In [6]:
%sql select * from emp_detail

 * sqlite:///./test.db
Done.

[('James', 25, 25000, 'Admin'),
 ('Robert', 33, 39000, 'Admin'),
 ('Richard', 41, 48000, 'Admin'),
 ('Thomas', 28, 30000, 'Admin'),
 ('Tom', 40, 55000, 'Finance'),
 ('Donald', 35, 38000, 'Finance'),
 ('Sara', 32, 44000, 'Finance'),
 ('Mike', 28, 25000, 'HR'),
 ('John', 35, 45000, 'HR'),
 ('Mary', 23, 30000, 'HR'),
 ('David', 32, 43000, 'HR')]

SQL to find Top 2 records from each department

In [9]:
%%sql
select empname,age,salary,department from (
select *,row_number() over(partition by department order by salary desc) rnk from emp_detail
) x where x.rnk<3

 * sqlite:///./test.db
Done.

[('Richard', 41, 48000, 'Admin'),
 ('Robert', 33, 39000, 'Admin'),
 ('Tom', 40, 55000, 'Finance'),
 ('Sara', 32, 44000, 'Finance'),
 ('John', 35, 45000, 'HR'),
 ('David', 32, 43000, 'HR')]